//
//  Const.swift
//  JumpMeasureApp
//
//  Created by jun.ogino on 2024/07/19.
//

import Foundation

// MEMO: テスト版ではiPhone 13 Pro Maxのカメラでキャリブレーションを行なった結果を仮の値として入れている
// 同機以外で撮影した場合、歪み補正はうまくいかない可能性が高い
//public struct Parameter {
//    //
//    public var ret: CGFloat
//    // カメラ行列
//    public var mtr: [[CGFloat]]
//    // 歪み係数
//    public var dist: [[CGFloat]]
//    // 回転ベクトル
//    public var rvecs: [[CGFloat]]
//    // 並進ベクトル
//    public var tvecs: [[CGFloat]]
//    public var totalError: CGFloat
//}

enum Constant {
    // 広角カメラのキャリブレーションパラメータ
    static let wideCameraParameter: CalibrateParameter = .init(
        ret: 0.9951336832307277,
        mtx: [[3.13747177e+03, 0.00000000e+00, 2.01233732e+03],
              [0.00000000e+00, 3.13580985e+03, 1.50500757e+03],
              [0.00000000e+00, 0.00000000e+00, 1.00000000e+00]],
        dist: [[ 2.31991420e-01, -1.25486110e+00, -5.73314387e-04, -2.82105983e-04, 2.01399019e+00]],
        rvecs: [[ 0.08245964],
                [-0.29777479],
                [-0.00620707]],
        tvecs: [[-3.03091729],
                [-2.83010704],
                [ 9.00841657]],
        totalError: 0.1409354499227512
    )

    // 超広角カメラのキャリブレーションパラメータ
    static let ultraWideCameraParameter: CalibrateParameter = .init(
        ret: 0.49554706454458425,
        mtx: [[1.63422411e+03, 0.00000000e+00, 2.02671206e+03],
              [0.00000000e+00, 1.63418016e+03, 1.51679866e+03],
              [0.00000000e+00, 0.00000000e+00, 1.00000000e+00]],
        dist: [[ 0.00328578, -0.01691511,  0.00016215,  0.00018233,  0.01309028]],
        rvecs: [[0.30342239],
                [0.21054931],
                [1.59220127]],
        tvecs: [[ 1.95360513],
                [-2.96534308],
                [ 4.86693904]],
        totalError: 0.07003385825470512
    )

    // 望遠カメラのキャリブレーションパラメータ
    static let telephotoCameraParameter: CalibrateParameter = .init(
        ret: 0.6642538601140131,
        mtx: [[9.27028446e+03, 0.00000000e+00, 1.98672770e+03],
              [0.00000000e+00, 9.26209726e+03, 1.63620215e+03],
              [0.00000000e+00, 0.00000000e+00, 1.00000000e+00]],
        dist: [[-1.11791778e+00,  4.46638116e+01, -5.08245273e-04,  6.88654583e-05, -5.02010190e+02]],
        rvecs: [[0.12738693],
                [0.02143578],
                [0.0034897 ]],
        tvecs: [[-3.57341084],
                [-3.37788585],
                [26.14357581]],
        totalError: 0.08606774593446528
    )
}
