//
//  Const.swift
//  JumpMeasureApp
//
//  Created by jun.ogino on 2024/07/19.
//

import Foundation

// MEMO: テスト版ではiPhone 13 Pro Maxのカメラでキャリブレーションを行なった結果を仮の値として入れている
// 同機以外で撮影した場合、歪み補正はうまくいかない可能性が高い
//public struct Parameter {
//    //
//    public var ret: CGFloat
//    // カメラ行列
//    public var mtr: [[CGFloat]]
//    // 歪み係数
//    public var dist: [[CGFloat]]
//    // 回転ベクトル
//    public var rvecs: [[CGFloat]]
//    // 並進ベクトル
//    public var tvecs: [[CGFloat]]
//    public var totalError: CGFloat
//}

enum Constant {
    // 広角カメラのキャリブレーションパラメータ
    static let wideCameraParameter: CalibrateParameter = .init(
        ret: 0.6546771737492645,
        mtx: [[3.08607114e+03, 0.00000000e+00, 2.02242894e+03],
              [0.00000000e+00, 3.08508316e+03, 1.51596027e+03],
              [0.00000000e+00, 0.00000000e+00, 1.00000000e+00]],
        dist: [[ 2.56895221e-01, -1.51218085e+00,  1.19925858e-03,  9.14725979e-04, 2.85032837e+00]],
        rvecs: [[ 0.22056039],
                [-0.0185404 ],
                [ 0.00158417]],
        tvecs: [[-2.35258303],
                [-3.00606068],
                [11.22720535]],
        totalError: 0.09034284423339786
    )

    // 超広角カメラのキャリブレーションパラメータ
    static let ultraWideCameraParameter: CalibrateParameter = .init(
        ret: 0.3446946731105252,
        mtx: [[1.63074157e+03, 0.00000000e+00, 2.00408888e+03],
              [0.00000000e+00, 1.63055411e+03, 1.50834307e+03],
              [0.00000000e+00, 0.00000000e+00, 1.00000000e+00]],
        dist: [[8.13095248e-03, -3.00355275e-02, 1.95130613e-04, -2.85172482e-06, 2.31836265e-02]],
        rvecs: [[ 0.22429733],
                [-0.01539032],
                [ 1.5863698 ]],
        tvecs: [[ 4.02154887],
                [-3.29225996],
                [ 5.71081944]],
        totalError: 0.04891143945171496
    )

    // 望遠カメラのキャリブレーションパラメータ
    static let telephotoCameraParameter: CalibrateParameter = .init(
        ret: 0.46154159295596703,
        mtx: [[9.25155537e+03, 0.00000000e+00, 2.04863442e+03],
              [0.00000000e+00, 9.24631070e+03, 1.48437788e+03],
              [0.00000000e+00, 0.00000000e+00, 1.00000000e+00]],
        dist: [[-1.09306354e+00, 4.49392187e+01, 2.25731534e-03, -5.27440100e-04, -5.14314020e+02]],
        rvecs: [[ 0.11365759],
                [-0.25446403],
                [ 0.00376248]],
        tvecs: [[-2.2488313 ],
                [-2.95835509],
                [29.31091099]],
        totalError: 0.06404108989125726
    )
}
